Revit 2018 API
VertexPositionColored Class
 A geometry vertex specified as a position in space with a color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public class VertexPositionColored : Vertex
Visual Basic
Public Class VertexPositionColored _
	Inherits Vertex
Visual C++
public ref class VertexPositionColored : public Vertex
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Vertex
 Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
See Also
VertexPositionColored Members
Autodesk.Revit.DB.DirectContext3D Namespace